// var ONLINE = false
var ONLINE = true


var text_waiting =['等待侦探方加入', '杰克胜利', '侦探胜利', '请返回主界面','请等待对方行动']
var text_day = ['等待玩家加入','第1天','第2天','第3天','第4天',]
var text_round = ['准备阶段','第1回合','第2回合','第3回合','第4回合','第5回合','第6回合','第7回合','第8回合','第9回合','第10回合','第11回合','第12回合','第13回合','第14回合','第15回合','第16回合','第17回合','第18回合','第19回合','第20回合' ]
var text_team = ['','杰克','侦探','侦探','杰克','侦探','杰克',]
var text_turn = [
    ['','锁定目标','调回警局','准备巡逻','血溅街头','疑虑丛生','打探虚实',],
    ['','夜间逃亡', '追踪凶犯', '调查线索', '', '结束追捕', '', ]
    ]
var text_desp = [
    ['', '从8个被害者中选择5个', '选择2个空警局调回侦探', '从7个位置选取5个巡逻位置', '选择立即击杀或等待一轮', '移动每个受害者位置', '选择打探的侦探位置', ],
    ['', '选择移动位置', '选择侦探与移动位置', '选择侦探与调查位置', '', '杰克已逃脱，结束后进入下一天', '', ]
]
var text_desp_jackSelect = ['','从8个位置选取5个受害者','从7个位置选取4个受害者','从6个位置选取3个受害者','从4个位置选取1个受害者']
var text_controlHelp = [
    ['', '点击若干红色地点-点击【执行】', '点击2个空的警察局地点-点击【执行】', '点击5个待选巡逻地点-点击【执行】', '等待：点击【等待】-点击【执行】；&#10击杀：点击无辜者地点-点击【执行】；&#10双杀：点击无辜者地点(假)-点击无辜者地点(真)-点击【执行】', '点击无辜者地点-点击目标地点-点击【执行】；&#10结束：点击【结束】', '点击侦探位置-点击【执行】', ],
    ['', '普通移动：点击目标地点-点击【执行】；&#10马车移动：点击【马车】-点击第一步地点-点击第二步地点-点击【执行】；&#10小巷移动：点击【小巷】-点击目标地点-点击【执行】；&#10移动后宣布回家：点击目标地点-点击【回家】-点击【执行】', '点击目标侦探-点击第一步地点（-点击第二步地点）-点击【执行】；&#10结束：点击【结束】', '搜查：点击目标侦探-点击搜查地点（-点击多个搜索地点）-点击【执行】；&#10抓捕：点击目标侦探-点击抓捕地点-点击【执行】；&#10结束：点击【结束】', '', '点击【结束】', '', ]
]

var policeList = ['A','B','C','D','E']
var colors_team = ['#fd2727','#1e56ff']

var round = 0
var turn = 0
var day = 0
var policeA = 0
var policeB = 0
var policeC = 0
var policeD = 0
var policeE = 0